{
  "halls": [
    {
      "id": 3952,
      "hall_name": "Зал 4",
      "hall_rows": 10,
      "hall_places": 5,
      "hall_config": [],
      "hall_price_standart": 200,
      "hall_price_vip": 560,
      "hall_open": 1
    },
    {
      "id": 3989,
      "hall_name": "Зал 1",
      "hall_rows": 10,
      "hall_places": 8,
      "hall_config": [],
      "hall_price_standart": 100,
      "hall_price_vip": 350,
      "hall_open": 1
    },
    {
      "id": 4008,
      "hall_name": "Зал 2",
      "hall_rows": 6,
      "hall_places": 12,
      "hall_config": [],
      "hall_price_standart": 350,
      "hall_price_vip": 400,
      "hall_open": 1
    },
    {
      "id": 4010,
      "hall_name": "123",
      "hall_rows": 10,
      "hall_places": 10,
      "hall_config": [],
      "hall_price_standart": -100,
      "hall_price_vip": 350,
      "hall_open": 0
    }
  ],
  "films": [
    {
      "id": 1229,
      "film_name": "Задом на перёд",
      "film_duration": 120,
      "film_description": "123",
      "film_origin": "Германия",
      "film_poster": "https://shfe-diplom.neto-server.ru/storage/app/img/posters/BlTpcb2QKQNnLqik2NbeZKwCc3bxvKMRHyR854BY.png"
    },
    {
      "id": 1264,
      "film_name": "Фильм",
      "film_duration": 120,
      "film_description": "Давным давно где-то там",
      "film_origin": "Америка",
      "film_poster": "https://shfe-diplom.neto-server.ru/storage/app/img/posters/CZejIw898p428nqdJpR3yV9S59zjHinebMiju5Za.png"
    },
    {
      "id": 1268,
      "film_name": "Титаник",
      "film_duration": 110,
      "film_description": "мелодрама",
      "film_origin": "США",
      "film_poster": "https://shfe-diplom.neto-server.ru/storage/app/img/posters/JSKgOYXEBCQiGpy9UKZv6B8lIpkYSP05Bn1JQPff.png"
    },
    {
      "id": 1303,
      "film_name": "Сальма",
      "film_duration": 240,
      "film_description": "В заброшенном пионерском лагере было очень много змей. Папин друг Степан Николаевич, бывший инженер, ставший егерем, говорил, что не помнит года, чтобы было так много змей. Они ползали в траве, лежали клубками на солнышке, одну, медянку, папа разрубил топором на куски и разбросал при входе в корпус, но змеи, то ли не понимали, что их здесь ждет смерть, то ли давно уже ничего не боялись и в этой отчаянной и заброшенной глуши чувствовали себя полными хозяевами тайги. Мы ехали в лагерь с заимки егеря не по дорогам, а по тропам, наш УАЗик с трудом преодолевал рытвины и овраги, переезжал горные реки. Один раз Степан Николаевич бросил рулить и вышел поправить ногой мостик, состоящий из двух бревен, и мне, и маме казалось, что мы не проедем, но машина, сопя и ухая, изнемогая от жаркого июля, чуть накренившись, выползла на ровную площадку. Дальше, в низине озер, синих, как глаза простого русского человека, зияли брошенные строения бывшего пионерлагеря. Ехать пришлось, потому что мама не сошлась характерами с женой егеря. Мама, закончив филфак и получив ставку младшего научного сотрудника на кафедре современной русской литературы, не могла понять, как в семье из девяти человек можно обходиться без посуды, а блины бросать со сковородки сразу на деревянный изъеденный короедами стол, откуда их еще горячими, хватали грязными руками голодные дети и наперегонки совали в красные желтозубые рты. От парного молока нас с мамой постоянно тошнило, и мы то и дело сидели на огороде, извергая из себя потоки зябкой и зловонной жидкости. И эти ссоры были скорее антисанитарного характера, мама никак не могла взять в толк, почему бы не вымыть избу или перед дойкой коровы не протереть животному вымя. Но Зинаида, женщина простая и плодородная, как южный чернозем, только смеялась, глядя на наши мучения. Ей, простой деревенской бабе, намертво влюбившей в себя инженера, закончившего Питерскую ЛИСМУ, было непонятно, зачем мы сюда приехали и что мы здесь ищем, что такое город, что такое институт, кто такие Бродский или Вознесенский. Во всей ее простоте скрывался не порок, а обычная языческая истина: чего суетиться, жизнь — не догонялки, радуйся каждому мгновению, люби и будь любимой. Все эти заповеди слетали с ее губ в советское время, как семечки. Однажды в очередной раз я робко попросила у Зинаиды тарелку, а она только ухмыльнулась, и тогда егерь вспомнил про заброшенный пионерский лагерь и завел свой видавший виды УАЗик. Мы забили машину своими рюкзаками и поехали, раскачиваясь из стороны в сторону по колдобинам. Степан Николаевич еще затолкал в машину полудикую кошку Сальму, сказав, что в лагере полно мышей. Это оказалось правдой, хотя странно, так много в тот год было в тайге змей, а змеи едят мышей, а вот смотри-ка. Когда-то в прудах вокруг лагеря пионеры разводили карпа. Полуметровые рыбины всплывали из глубины на звук колокольчика и кормились брошенным в воду горохом и кукурузой, но теперь лагерь был забыт и оставлен на растерзание таежной природе. Карпы одичали, и их можно было поймать только на миллиметровую леску с наживкой из жареного картофеля. Папа вылавливал и пятикилограммовых, и десяти, а мама жарила их на сковородке. На кухне было много оставленной посуды. Куски разрезанного карпа, посыпанные мукой, еще некоторое время прыгали по горячей поверхности, как бы говоря, мы еще живы, нас непросто убить, мы плевали на ваши ножи. Мы ели рыбу и бросали головы кошке, но у нее был свой улов — мыши. Она приносила их десятками, складывала на крыльце и очень гордилась своей добычей. Садилась рядом и вылизывалась на солнышке, растягивалась, как дембель на отдыхе, усы ее трепыхались как радиоантенны, а острые маленькие ушки ни на минуту не прекращали вслушиваться в высокую сочную маслянистую траву. Не бежит ли очередная жертва. Как мы любили Сальму! Как мы любили Сальму! Но в руки кошка не давалась. Только папа мог иногда взять ее на колени, но Сальма, не просидев и минуты, нарочито горделиво, но очень вежливо, спрыгивала на землю и, понюхав миску с рыбьей головой, уходила в лес в поисках мышей. Однажды кошка приволокла гадюку. Я не знаю, откуда в средней полосе гадюка, а может, нам просто показалось, у страха глаза велики, мало ли что городскому жителю померещится, но кошка приволокла мертвую змею и уложила ее рядом с мышами на крыльцо. Я и мама отбежали в сторону, потому что очень испугались, а папа взял ветку можжевельника и ткнул ею в змею, но ничего не произошло, змея была мертвая. К сентябрю пошли дожди, и дороги размыло. Стена колкого и суетливого, как вокзальный воришка, дождя вылизала склоны и глинистую почву, образовались глубокие ямы с водой, которая намертво стояла и не уходила в землю. Степан Николаевич никак не мог проехать на УАЗике к нам в лагерь, а мне нужно было идти учиться в школу, да и у мамы начинался семестр в институте. Мы сидели вчетвером в административном корпусе и играли в карты. Кошка Сальма не ловила больше мышей, а только лениво взирала на нас из угла, как бы спрашивая, ну чего, долго еще, сколько можно. Я даже не знаю, зачем мы взяли ее в Ленинград, когда закончились дожди. За старые заслуги. За мертвую змею. Но это же была полудикая кошка, не признававшая людей, что ей делать в нашей двушке на Лиговке, в которой ко всему прочему жила оранжево-лимонная канарейка Галька в метровой стальной клетке. Трепетное, слабенькое, эфирное и удивительное существо, всеобщая любимица, как ее называл папа. Когда Галька вылетала из клетки, то садилась ему на голову, и они расхаживали по квартире, как будто добрейший великан пригрел у себя на теле нежное и милое существо. Вселенская благость спускалась папе на лицо. Галька тоже радовалась. Чирикала, пела, смеялась по-птичьи, но однажды не уследили за Сальмой. Точнее, просто забыли про кошку, а она же охотница, полудикая, прыг, скок на подоконник, хвать и нету Гальки. Папа, увидев бездыханное тельце, устроил Сальме в туалете головомойку, мы с братом Олегом, насмотревшись на папу, тоже кошке всыпали от души, и спасло ее только то, что утром папа унес ее в универмаг, в котором он был директором. Там она приобрела утраченный авторитет охотой на разжиревших и обнаглевших крыс, которых видимо-невидимо развелось в подвале.",
      "film_origin": "Германия",
      "film_poster": "https://shfe-diplom.neto-server.ru/storage/app/img/posters/bcdXZwp4X0eNf1S9ymLKry6ROa9Qib7CWjPeA4f7.png"
    },
    {
      "id": 1313,
      "film_name": "Унесенные ветром",
      "film_duration": 222,
      "film_description": "Могучие ветры Гражданской войны в один миг уносят беззаботную юность южанки Скарлетт О`Хара, когда привычный шум балов сменяется грохотом канонад на подступах к родному дому. Для молодой женщины, вынужденной бороться за новую жизнь на разоренной земле, испытания и лишения становятся шансом переосмыслить идеалы, обрести веру в себя и найти настоящую любовь.",
      "film_origin": "США",
      "film_poster": "https://shfe-diplom.neto-server.ru/storage/app/img/posters/Ye3uwOTDo84oesD7w13ejs4oFikLC6j6MoPojTSo.png"
    },
    {
      "id": 1315,
      "film_name": "Пчеловод",
      "film_duration": 120,
      "film_description": "Боевик",
      "film_origin": "Великобритания",
      "film_poster": "https://shfe-diplom.neto-server.ru/storage/app/img/posters/aFg9j1nMzDjGrQN9FbGbWPyAMtdlaJzXCF1ZFZnJ.png"
    }
  ],
  "seances": [
    {
      "id": 2414,
      "seance_hallid": 3952,
      "seance_filmid": 1313,
      "seance_time": "09:30"
    },
    {
      "id": 2416,
      "seance_hallid": 4008,
      "seance_filmid": 1315,
      "seance_time": "18:00"
    }
  ]
}
